
&НаСервере
Процедура ЗашифроватьНаСервере()
	Строка = ИсходныйТекст;
	Шаг = Шаг;
	Смещение = 0;
	Шифр = "";
	Алфавит = "абвгдеёжзийклмнопрстуфхцчшщьыъэюя";
	ЗашифрованныйСимвол = "";
	ИндексСмещения = 0;
	// Опишем алфавит как одномерный массив
	АлфавитМассив = Новый Массив;
	ДлинаАлфавита = 33;
	Для Индекс=1 По ДлинаАлфавита Цикл
		БукваАлфавита = Сред(Алфавит, Индекс, 1);
		АлфавитМассив.Добавить(БукваАлфавита);
	КонецЦикла;
	
	Если Шаг > ДлинаАлфавита Тогда
		Смещение = Шаг%ДлинаАлфавита;
	Иначе
		 Смещение = Шаг;
	КонецЕсли;
	// Зашифруем исходную строку.
	Для Счетчик = 1 По СтрДлина(Строка) Цикл
		ИсходныйСимвол = НРег(Сред(Строка, Счетчик, 1)); // Получим букву исходной строки.
		ИндексИсходногоСимвола = АлфавитМассив.Найти(ИсходныйСимвол);
		Если ИндексИсходногоСимвола = Неопределено Тогда // Символы, которые не являются буквами русского алфавита, оставим без шифрования.
			ЗашифрованныйСимвол = ИсходныйСимвол;
		Иначе
			ИндексЗашифрованногоСимвола = ИндексИсходногоСимвола + Смещение;
			Если ИндексЗашифрованногоСимвола > ДлинаАлфавита - 1 Тогда // При достижении конца алфавита выполняется циклический переход к его началу.
				ИндексСмещения = ИндексЗашифрованногоСимвола - ДлинаАлфавита;
				ЗашифрованныйСимвол = АлфавитМассив[ИндексСмещения];
			Иначе
				ЗашифрованныйСимвол = АлфавитМассив[ИндексЗашифрованногоСимвола];
			КонецЕсли;
		КонецЕсли;
		Шифр = Шифр + ЗашифрованныйСимвол;
	КонецЦикла;
	
	ЭтаФорма.Результат = Шифр;
КонецПроцедуры

&НаКлиенте
Процедура Зашифровать(Команда)
	ЗашифроватьНаСервере();
КонецПроцедуры
