
&НаСервере
Процедура ЗашифроватьНаСервере()
	Строка = ЭтаФорма.ИсходныйТекст;
	Шаг = ЭтаФорма.Шаг;
	Смещение = 0;
	Шифр = "";
	Алфавит = "абвгдеёжзийклмнопрстуфхцчшщьыъэюя";
	ЗашифрованныйСимвол = "";
	ИндексСмещения = 0;
	//Опишем алфавит как одномерный массив
	АлфавитМассив = Новый Массив;
	Для Индекс=1 По 33 Цикл
		БукваАлфавита = Сред(Алфавит, Индекс, 1);
		АлфавитМассив.Добавить(БукваАлфавита);
	КонецЦикла;
	
	Если Шаг > 33 Тогда
		Смещение = Шаг%33;
	Иначе
		 Смещение = Шаг;
	КонецЕсли;
	//Зашифруем исходную строку.
	Для Счетчик = 1 По СтрДлина(Строка) Цикл
		ИсходныйСимвол = НРег(Сред(Строка, Счетчик, 1)); //Получим букву исходной строки.
		ИндексИсходногоСимвола = АлфавитМассив.Найти(ИсходныйСимвол);
		Если ИндексИсходногоСимвола = Неопределено Тогда //Символы, которые не являются буквами русского алфавита, оставим без шифрования.
			ЗашифрованныйСимвол = ИсходныйСимвол;
		Иначе
			ИндексЗашифрованногоСимвола = ИндексИсходногоСимвола + Смещение;
			Если ИндексЗашифрованногоСимвола > 32 Тогда //При достижении конца алфавита выполняется циклический переход к его началу.
				ИндексСмещения = ИндексЗашифрованногоСимвола - 33;
				ЗашифрованныйСимвол = АлфавитМассив[ИндексСмещения];
			Иначе
				ЗашифрованныйСимвол = АлфавитМассив[ИндексЗашифрованногоСимвола];
			КонецЕсли;
		КонецЕсли;
		Шифр = Шифр + ЗашифрованныйСимвол;
	КонецЦикла;
	
	ЭтаФорма.Результат = Шифр;
КонецПроцедуры

&НаКлиенте
Процедура Зашифровать(Команда)
	ЗашифроватьНаСервере();
КонецПроцедуры
